#es.gob.afirma.tsl.access.TSLManager
TM_LOG001= Se produjo un error al tratar de parsear y comprobar la TSL.
TM_LOG002= No existe una TSL en la ruta especificada.
TM_LOG003 =Se procede a tratar de validar el certificado con la TSLv{0} {1}-{2}.
TM_LOG004 =El certificado a analizar contiene la extensi\u00F3n id_kp_timestamping entre sus atribuciones, por lo que se considera un certificado para firmas de sello de tiempo.
TM_LOG005 = El certificado a analizar NO se corresponde con el de firma de sello de tiempo, ya que NO contiene la extensi\u00F3n id_kp_timestamping entre sus atribuciones.
TM_LOG006= Se produjo un error al validar el certificado mediante TSL tratando de comprobar si dicho certificado tiene como keyPurpose el OID para id-kp-timestamping.
TM_LOG007= Se produjo un error durante la validaci\u00F3n del certificado usando la TSL del territorio [{0}] y n\u00FAmero de secuencia [{1}].
TM_LOG008= Se produjo un error al descargar la TSL de la uri {0}.
TM_LOG009= No se pudieron obtener los mapeos propios de la regi\u00F3n de la TSL asociada al certificado. Se continuar\u00E1 el proceso sin dicha informaci\u00F3n.

#es.gob.afirma.tsl.parsing.impl.common.ATSLBuilder
ATB_LOG001=Error parseando la TSL, el flujo de datos de entrada (XML) es nulo.
ATB_LOG002=Error leyendo el flujo de entrada con los datos de la TSL.
ATB_LOG003=No se ha encontrado el atributo [{0}] cuando este es obligatorio.
ATB_LOG004=Error al parsear el atributo [{0}] en la TSL.
ATB_LOG005=Error al parsear el elemento [{0}] en la TSL.
ATB_LOG006=Error al parsear el elemento [{0}]. No tiene un valor correcto.
ATB_LOG007=Error al parsear el atributo [{0}]. No tiene un valor correcto.
ATB_LOG008=Se ha detectado en el campo TSPInformationAddress un formato incorrecto de URI [{0}]. Se han eliminado los espacios en blanco y se contin\u00FAa con el proceso.
ATB_LOG009=Error al parsear la TSL bajo el est\u00E1ndar ETSI TS 119612 2.1.1.

#es.gob.afirma.tsl.parsing.impl.tsl119612.v020101.TSLBuilder
TB_LOG001=Error: El elemento [{0}] no puede ser nulo.
TB_LOG002=Para el elemento [{0}] se va a cambiar el valor [{1}] por [{2}], el cual s\u00ED es reconocido por la especificaci\u00F3n [{3}].
TB_LOG003=Error: La extensi\u00F3n [{0}] no puede tener el valor [{1}].
TB_LOG004=Se ha detectado un TSP Service con el tipo [{0}] el cual se encuentra mal definido en la especificac\u00F3n (errata). Se sustituye autom\u00E1ticamente su valor por [{1}], el cual es el correcto.
TB_LOG005=Error: El elemento [{0}] tiene un valor incorrecto.

#es.gob.afirma.tsl.parsing.impl.common.TSLObject
TO_LOG001= Error: No es posible asignar un valor nulo al atributo [{0}] en la TSL.
TO_LOG002= Error: No es posible asignar un valor nulo al elemento [{0}] en la TSL.
TO_LOG003= Error: No es posible a\u00F1adir un nuevo elemento {0} con valor nulo en la TSL.

#es.gob.afirma.tsl.parsing.impl.tsl119612.v020101.TSLChecker
TC_LOG001=Error: El atributo [{0}] tiene un valor incorrecto.
TC_LOG002=Error: El elemento [{0}] no puede ser nulo.
TC_LOG003=Error: El elemento [{0}] tiene un valor incorrecto.
TC_LOG004=Error: El c\u00F3digo de regi\u00F3n [{0}] del certificado firmante de la TSL no coincide con el territorio especificado en esta [{1}].
TC_LOG005=Error: Para la especificaci\u00F3n ETSI TS 119612 2.1.1 resulta necesario que el elemento [{0}] se encuentre al menos en ingl\u00E9s.
TC_LOG006=Error: Para la especificaci\u00F3n ETSI TS 119612 2.1.1, el elemento [{0}] no tiene un valor bien definido.
TC_LOG007=No se ha encontrado alguna de las URIs [{0}] dentro de los TSL Pointers de la TSL, y al tratarse de una TSL de un miembro europeo, debe definirse.
TC_LOG008=El TSP [{0}] no define en su elemento [{1}] un valor que represente su identificador oficial. Se relaja esta comprobaci\u00F3n y se contin\u00FAa con el proceso.
TC_LOG009=Error: No se permiten extensiones cr\u00EDticas para un TSP perteneciente a una TSL de un miembro europeo.
TC_LOG010=Error: Para el servicio [{0}] de tipo CA/QC es requerido que tenga definida al menos la extensi\u00F3n AdditionalServiceInformation.
TC_LOG011=Elemento [{0}] no encontrado en la firma de la TSL.
TC_LOG012=El elemento Transform definido e SignedInfo-Reference-Transforms que apunta a [{0}] en la posici\u00F3n [{1}] debe definir la URI [{2}].
TC_LOG013=El n\u00FAmero de elementos Transform definidos en SignedInfo-Reference-Transforms que apunta a [{0}] debe ser 2.
TC_LOG014=El elemento Transforms debe estar definido en el SignedInfo-Reference que apunta a [{0}].
TC_LOG015=Elemento Reference apuntando al identificador XML [{0}] no encontrado.
TC_LOG016=No se ha encontrado el elemento CanonicalizationMethod dentro del SignedInfo.
TC_LOG017=El elemento CanonicalizationMethod de SignedInfo debe definir la URI [{0}].
TC_LOG018=Error: El elemento Digital Identity es de tipo no reconocido.
TC_LOG019=Error: El elemento Digital Identity de tipo X509Certificate no contiene el certificado asociado.
TC_LOG020=Error: El elemento Digital Identity de tipo X509SubjectName contiene una cadena vac\u00EDa.
TC_LOG021=Error: El elemento Digital Identity de tipo KeyValue no contiene el KeyValue.
TC_LOG022=Error: El elemento Digital Identity de tipo X509SKI no contiene el X509SKI.
TC_LOG023=Error: El elemento Digital Identity de tipo Other contiene una cadena vac\u00EDa.
TC_LOG024=La diferencia entre la fecha de emisi\u00F3n de la TSL y su fecha de caducidad deber\u00EDa ser un m\u00E1ximo de 6 meses. Se contin\u00FAa el proceso ingnorando este error.
TC_LOG025=Error: No se permiten extensiones del esquema si la TSL pertenece a un miembro europeo.
TC_LOG026=Error: Para la definici\u00F3n hist\u00F3rica de un servicio de tipo PKI no se pueden definir identidades digitales de tipo X509Certificate.
TC_LOG027=Error: Para la definici\u00F3n hist\u00F3rica de un servicio de tipo PKI debe definirse al menos una identidad digital de tipo X509SKI.
TC_LOG028=El elemento KeyInfo debe estar definido.
TC_LOG029=Solo debe haber un elemento de tipo X509Data dentro del KeyInfo.
TC_LOG030=Solo debe haber un elemento de tipo KeyValue dentro del KeyInfo.
TC_LOG031= Solo debe haber un elemento de tipo SKIData dentro del KeyInfo.
TC_LOG032=El elemento KeyInfo no define ning\u00FAn elemento de tipo X509Data, KeyValue o SKIData.
TC_LOG033=El elemento QualifyingProperties debe estar definido en una firma XAdES.
TC_LOG034=No se recuper\u00F3 el certificado firmante de la TSL.
TC_LOG035=El elemento QualifyingProperties debe definir el atributo target con el mismo valor que el identificador de la firma.
TC_LOG036=Debe definirse al menos un elemento Cert dentro de SigningCertificate.
TC_LOG037=No se valid\u00F3 correctamente el SigningCertificate de Qualifying Properties frente al KeyInfo.
TC_LOG038=Error: La organizaci\u00F3n [{0}] del certificado firmante de la TSL no coincide con ning\u00FAn nombre de operador definido en esta.
TC_LOG039=Error: El uso de clave del certificado firmante de la TSL no est\u00E1 establecido \u00FAnicamente a digitalSignature y/o nonRepudiation.
TC_LOG040=Error: Se produjo un error al tratar de extraer la extensi\u00F3n SubjectKeyIdentifier del certificado firmante de la TSL.
TC_LOG041=Error: Se produjo un error al parsear el certificado firmante de la TSL.
TC_LOG042=Error: La extensi\u00F3n SubjectKeyIdentifier no se encuentra definida en el certificado firmante de la TSL.
TC_LOG043=Error: Se produjo un error al tratar de calcular el Hash SHA-1 de la extensi\u00F3n SubjectKeyIdentifier del certificado firmante de la TSL.
TC_LOG044=Error: La extensi\u00F3n SubjectKeyIdentifier del certificado firmante de la TSL no se encuentra definida de ninguno de los dos primeros m\u00E9todos del apartado 4.2.1.2 de la RFC5280.
TC_LOG045=Error: Se produjo un error al tratar de extraer la extensi\u00F3n con las restricciones b\u00E1sicas del certificado firmante de la TSL.
TC_LOG046=Error: La extensi\u00F3n de restricciones b\u00E1sicas del certificado firmante de la TSL indica CA=true.
TC_LOG047=Error al parsear la TSL bajo el est\u00E1ndar ETSI TS 119612 2.1.1.

#es.gob.afirma.tsl.parsing.impl.common.ATSLChecker
ATC_LOG001=Error: El atributo [{0}] no puede ser nulo.
ATC_LOG002=Error: El elemento [{0}] tiene un valor incorrecto.
ATC_LOG003=Error: El elemento [{0}] no puede ser nulo.
ATC_LOG004=Error al verificar la firma de la TSL.
ATC_LOG005=El certificado X509v3 para comprobar si contiene la extensi\u00F3n de uso de clave para la firma de TSL es nulo.
ATC_LOG006=No hay extensiones de uso de claves para el certificado X509v3.
ATC_LOG007=La lista de extensiones de uso de claves del certificado X509v3 no contiene la referente a la firma de TSL.
ATC_LOG008=Hubo un error parseando el certificado X509v3 para comprobar si contiene la extensi\u00F3n de uso de clave para la firma de TSL.
ATC_LOG009=Se produjo un error al tratar de comprobar si el certificado firmante de la TSL se encuentra en el almac\u00E9n de confianza correspondiente.
ATC_LOG010=Se produjo un error al intentar extraer los certificados firmantes de la TSL.
ATC_LOG011=Error al parsear la TSL bajo el est\u00E1ndar ETSI TS 119612 2.1.1.
ATC_LOG012=No se ha encontrado el certificado firmante de la TSL (con emisor [{0}] y n\u00FAmero de serie [{1}]) dentro del almac\u00E9n de confianza correspondiente.
ATC_LOG013=Error: Para un servicio de tipo no PKI, no se permiten identidades PKI.
ATC_LOG014=Error: Para un servicio de tipo no PKI, la identidad digital debe ser una URI.
ATC_LOG015=Se produjo un error comprobando los valores del TSP-Service [{0}], y dentro de este en el Service-History-Instance [{1}], por lo que este servicio hist\u00F3rico se marcar\u00E1 como NO usable. El error es el siguiente: {2}
ATC_LOG016=Se produjo un error comprobando los valores del TSP-Service [{0}], por lo que este servicio se marcar\u00E1 como NO usable (de forma indendiente a su hist\u00F3rico si lo tuviera). El error es el siguiente: {1}


#es.gob.afirma.tsl.access.TSLProperties
TP_LOG001=Se produjo un error al tratar de recuperar la propiedad [{0}]. Se tomar\u00E1 para esta el valor por defecto [{1}].
TP_LOG002=No se ha conseguido parsear el valor [{0}] en la propiedad [{1}], por lo que ser\u00E1 ignorado.


#es.gob.afirma.tsl.parsing.impl.common.TSLCertificateExtensionAnalyze
TCEA_LOG001=El certificado a analizar para extraer la informaci\u00F3n de sus extensiones no puede ser nulo.
TCEA_LOG002=Se produjo un error al tratar de parsear el certificado con la librer\u00EDa IAIK.
TCEA_LOG003=Se produjo un error tratando de extraer los QcStatements del certificado para analizarlos.
TCEA_LOG004=Se produjo un error tratando de extraer los CertificatePolicies del certificado para analizarlos.
TCEA_LOG005=Se produjo un error tratando de extraer la informaci\u00F3n de la extensi\u00F3n QcStatements - EuType para analizarla.
#es.gob.afirma.tsl.certValidation.impl.common.ATSLValidator
ATV_LOG001=No se puede realizar la validaci\u00F3n de un certificado mediante TSL si este es nulo.
ATV_LOG002=Para ejecutar la validaci\u00F3n del estado de revocaci\u00F3n de un certificado mediante TSL, es necesario especificar una fecha de validaci\u00F3n.
ATV_LOG003=La TSL a usar representa una lista de listas (referencia a otras TSL). Para estos casos se considera directamente el certificado a validar como NO detectado.
ATV_LOG004=El estado de determinaci\u00F3n de la TSL a usar para la validaci\u00F3n se encuentra en modo 'Delinquent' o equivalente.
ATV_LOG005=Se ha encontrado un servicio de tipo TSA en la TSL que identifica en sus identidades digitales al emisor del certificado a validar.
ATV_LOG006=Se ha encontrado un servicio de tipo CA en la TSL que identifica en sus identidades digitales al certificado a validar.
ATV_LOG008=Se produjo un error comprobando si el certificado a validar est\u00E1 firmado por uno de los certificados definidos en los Identities del TSP Service. Se contin\u00FAa con el proceso a pesar del error.
ATV_LOG009=Se ha encontrado un servicio de tipo CA en la TSL que identifica en sus identidades digitales al emisor del certificado a validar.
ATV_LOG010=Se produjo un error al recuperar el Subject Key Identifier del certificado emisor detectado que identifica al certificado a validar.
ATV_LOG011=El certificado a detectar no cumple con las condiciones establecidas en las extensiones AdditionalServiceInformation, pero por recomendaci\u00F3n de Direcci\u00F3n de Proyecto, de momento esta restricci\u00F3n no se tiene en cuenta y se contin\u00FAa normalmente con el proceso considerando desconocido si el certificado es cualificado o no.
ATV_LOG012=Se produjo un error evaluando el certificado frente a los CriteriaList de la extension Qualifications, pero al no ser cr\u00EDtica, se ignora el error y se contin\u00FAa con el proceso.
ATV_LOG013=La extensi\u00F3n Qualifications no se encuentra definida para el servicio seleccionado en la TSL, y el certificado no cumple los requisitos establecidos en la especificaci\u00F3n para que dicha extensi\u00F3n pueda omitirse. A pesar de ello, se ha tomado la decisi\u00F3n de considerar detectado el certificado por el servicio (y por la TSL).
ATV_LOG014=Se ha determinado el estado de revocaci\u00F3n del certificado por el estado del servicio que lo identifica.
ATV_LOG015=Se ha detectado el certificado.
ATV_LOG016=El certificado se considera validado por el servicio.
ATV_LOG017=Se procede a comprobar el estado de revocaci\u00F3n del certificado mediante los puntos de distribuci\u00F3n que tenga definidos (o extensi\u00F3n AIA).
ATV_LOG018=No se ha determinado el estado de revocaci\u00F3n con la informaci\u00F3n contenida en este. Se procede a buscar un servicio dentro del mismo TSP que proporcione procedimientos de comprobaci\u00F3n para el estado de revocaci\u00F3n del certificado.
ATV_LOG019=Se produjo un error evaluando el certificado frente a los CriteriaList de la extension Qualifications, y al ser cr\u00EDtica, el certificado es rechazado por el proceso de detecci\u00F3n frente a la TSL.
ATV_LOG020=No se ha detectado el certificado.
ATV_LOG021= , haciendo uso de la informaci\u00F3n del hist\u00F3rico de este, concretamente del servicio [{0}] con fecha de inicio de estado [{1}]
ATV_LOG022=El certificado ha sido detectado en la TSL por el TSP [{0}] y su servicio [{1}]{2}. Se ha comprobado el estado de revocaci\u00F3n del certificado mediante el servicio [{3}]{4}: [{5}]
ATV_LOG023=V\u00E1lido.
ATV_LOG024=Revocado.
ATV_LOG025= Cadena de certificaci\u00F3n no v\u00E1lida.
ATV_LOG026=El Servicio se encuentra revocado.
ATV_LOG027=El estado del servicio no es v\u00E1lido (cadena no v\u00E1lida).
ATV_LOG028=El certificado ha sido detectado en la TSL por el TSP [{0}] y su servicio [{1}]{2}. Adem\u00E1s se ha determinado su estado de revocaci\u00F3n: [{3}]
ATV_LOG029=No se ha podido identificar ning\u00FAn servicio en ning\u00FAn TSP de la TSL que identifique al certificado a validar.
ATV_LOG030=El certificado ha sido detectado en la TSL por el TSP [{0}] y su servicio [{1}][{2}], pero no pudo comprobarse el estado de revocaci\u00F3n de este.
ATV_LOG031=El certificado ha sido detectado en la TSL por el TSP [{0}] y su servicio [{1}].
ATV_LOG032=El estado de revocaci\u00F3n es desconocido.
ATV_LOG033=Como la fecha de emisi\u00F3n del certificado [{0}] es posterior a la fecha indicada en el TSP [{1}] se usa el estado actual del TSP.
ATV_LOG034=Como la fecha de emisi\u00F3n del certificado [{0}] es anterior a la fecha indicada en el TSP [{1}] se busca entre sus hist\u00F3rico.
ATV_LOG035=Como tspServiceType es TSA/QTST, es CUALIFICADO
ATV_LOG036=Como tspServiceType [{0}], el certificado es NO CUALIFICADO.
ATV_LOG037=Se trata de un servicio tipo CA.
ATV_LOG038=Es un certificado de una CA, se considera detectada y CUALIFICADA.
ATV_LOG039=Se comprueba que los valores de las extensiones AdditionalServiceInformation concuerdan con los del certificado. Esto depende de la especificaci\u00F3n.
ATV_LOG040= Se ha encontrado la extensi\u00F3n, y el certificado encaja con su definici\u00F3n, se considera CUALIFICADO.
ATV_LOG041=Se comprueba si el certificado de entrada es detectado por los criterios de la Extensi\u00F3n de Cualificaciones del Servicio TSP de entrada.
ATV_LOG042=Se recorre la lista de extensiones del servicio, buscando que sea de tipo Qualifications.
ATV_LOG043=Se recorre la lista de Qualifications obtenidos. Se analiza si se cumplen los criteria para detectar el certificado.
ATV_LOG044=Un criteria ha identificado el certificado, se analiza para determinar mapeos del certificado.
ATV_LOG045= Como la URI de qualifier es [{0}], qscd es [{1}].
ATV_LOG046=Como se trata de una cA/PKC, el certificado es NO CUALIFICADO.
ATV_LOG047=Una vez detectado el certificado, se establece su estado dependiendo del TSPService.
ATV_LOG048=No se encontró ningún Qualifications Extensions...
ATV_LOG049= El TSP [{0}] identifica el certificado, se establece la clasificaci\u00F3n a sello de tiempo.

#es.gob.afirma.tsl.parsing.impl.common.extensions.CriteriaList
CL_LOG001=Error: La extensi\u00F3n [{0}] debe definir un valor para el atributo [{1}].
CL_LOG002=Error: La extensi\u00F3n [{0}] no puede tener el valor [{1}].
CL_LOG003=Se produjo un error al evaluar si el certificado cumple los criterios adicionales establecidos por el TSP-Service para detectarlo. Se considera que el certificado no cumple el criterio.
CL_LOG004=Se produjo un error mientras se trataba de parsear el certificado a validar para obtener su extension 'CertificatePolicies'. Se considera que el certificado no cumple el criterio.

#es.gob.afirma.tsl.certValidation.impl.common.DigitalIdentitiesProcessor
DIP_LOG001=Se produjo un error comprobando si el certificado a validar est\u00E1 firmado por uno de los certificados definidos en los Identities del TSP Service. Se contin\u00FAa con el proceso a pesar del error.
DIP_LOG002=Se produjo un error al recuperar el Subject Name del certificado emisor detectado que identifica al certificado a validar.
DIP_LOG003=Se produjo un error al recuperar el Subject Key Identifier del certificado emisor detectado que identifica al certificado a validar.
DIP_LOG004=Se produjo un error tratando de verificar el certificado a validar mediante una clave p\u00FAblica obtenida del TSP Service. Se contin\u00FAa con el proceso a pesar del error.
DIP_LOG005=Se produjo un error tratando de comparar el emisor del certificado a validar con el asunto obtenido en el identity del TSP Service. Se contin\u00FAa con el proceso a pesar del error.
DIP_LOG006=Se produjo un error obteniendo la extensi\u00F3n AuthorityKeyIdentifier del certificado a validar. Se contin\u00FAa con el proceso a pesar del error.
DIP_LOG007=Se produjo un error comprobando si el certificado a validar coincide con alguno de los certificados definidos en los Identities del TSP Service. Se contin\u00FAa con el proceso a pesar del error.

#es.gob.afirma.tsl.utils.UtilsASN1
UA_LOG001 = Error durante la creaci\u00F3n del certificado.
UA_LOG002= Error al obtener informaci\u00F3n del certificado.


#es.gob.afirma.tsl.certValidation.impl.common.TSLValidatorThroughOCSP
TV_LOG001= Se trata de obtener la respuesta OCSP atacando al servidor situado en la URI: [{0}].
TV_LOG002=No se ha conseguido comprobar el estado de revocaci\u00F3n del certificado mediante OCSP.
TV_LOG003=La respuesta OCSP no se considera v\u00E1lida ya que el firmante no cumple las condiciones necesarias o es desconocido.
TV_LOG004=Se ha obtenido (y validado) con \u00E9xito la respuesta OCSP obtenida de la URI: [{0}].
TV_LOG005=Hubo un error al tratar de construir el objeto CertID para validar el certificado mediante OCSP.
TV_LOG006=Se produjo un error al tratar de generar y enviar la petici\u00F3n OCSP a [{0}].
TV_LOG007=La respuesta OCSP no es de tipo BasicOCSPResponse, que es la \u00FAnica soportada, por lo que se continuar\u00E1 buscando otra alternativa para validar el certificado.
TV_LOG008=El estado de la respuesta OCSP no es v\u00E1lido [{0}], por lo que se continuar\u00E1 buscando otra alternativa para validar el certificado.
TV_LOG009=No se pudo comprobar si la respuesta OCSP est\u00E1 firmada por el emisor del certificado a validar ya que no se sabe la clave p\u00FAblica de este.
TV_LOG010=La respuesta OCSP no est\u00E1 firmada por un certificado v\u00E1lido, por lo que se continuar\u00E1 buscando otra alternativa para validar el certificado.
TV_LOG011=Se produjo un error parseando la respuesta OCSP para comprobar el estado de revocaci\u00F3n del certificado a validar.
TV_LOG012=La respuesta OCSP indica que el certificado a validar es desconocido.
TV_LOG013=Hubo un error al tratar de consultar si el certificado a validar se encuentra revocado sobre la CRL.
TV_LOG014=Se produjo un error al recuperar la informaci\u00F3n de acceso a los servicios de la autoridad del certificado a validar.
TV_LOG015=La respuesta OCSP no se considera v\u00E1lida ya que el firmante no cumple las condiciones necesarias o es desconocido.
TV_LOG016=No se ha conseguido comprobar el estado de revocaci\u00F3n del certificado mediante OCSP.
TV_LOG017=Se ha encontrado el emisor del certificado (de CA intermedia) dentro del propio TSP que lo detecta.
TV_LOG018=NO se ha encontrado el emisor del certificado (de CA intermedia) dentro del propio TSP que lo detecta.
TV_LOG019=Se produjo un error mientras se trataba de parsear el certificado a validar para obtener informaci\u00F3n y extensiones. Se considera que el certificado no cumple las condiciones para ser detectado.
TV_LOG020=Se ha producido un error obteniendo/parseando la respuesta OCSP de [{0}].
TV_LOG021=No se conf\u00EDa en el responder de la respuesta OCSP. Dicho responder es [{0}] emitido por [{1}].
TV_LOG022=Se produjo un error al tratar de parsear el certificado a validar con la librer\u00EDa de IAIK, por lo que se anula el proceso de validaci\u00F3n.
TV_LOG023=Se produjo un error verificando la respuesta OCSP, por lo que se continuar\u00E1 buscando otra alternativa para validar el certificado.
TV_LOG024=Se produjo un error al comprobar si el certificado firmante de la respuesta OCSP est\u00E1 habilitado para firmar respuestas OCSP, por lo que se continuar\u00E1 buscando otra alternativa para validar el certificado.
TV_LOG025=Se produjo un error al recuperar los puntos de distribucion de tipo CRL del certificado a validar.
TV_LOG026=Se recuperan la lista de extensiones de servicio...
TV_LOG027=Contiene extensi\u00F3n [{0}].
TV_LOG028=CertClassification es WSA ya tiene la extensi\u00F3n ForWebSiteAuthentication y cumple que el certificado tiene la entrada 'id-etsi-qct-web:0.4.0.1862.1.6.3' o la entrada 'qcp-web:0.4.0.194112.1.4'
TV_LOG029=Se extrae la siguiente informacion del certificado a validar...
TV_LOG030=QcStatementOids [{0}]
TV_LOG031=PolicyInformationOids [{0}]
TV_LOG032=QcStatementExtEuTpeOids [{0}]
TV_LOG033=CertClassification es ESEA, tiene la extension ForeSeals y cumple que el certificado contiene la entrada 'id-etsi-qct-eseal : 0.4.0.1862.1.6.2' o bien, el certificado contiene alguna de las OIDs siguientes:  'qsc-legal : 0.4.0.194112.1.1' o  'qcp-legal-qscd : 0.4.0.194112.1.3'
TV_LOG034=CertClassification es ESIG, tiene la extension ForeSignatures y cumple que el certificado contiene alguna extension QscStatement o bien, tiene alguna de las siguientes entradas: 'qcp-public-with-sscd:0.4.0.1456.1.1', 'qcp-public:0.4.0.1456.1.2', 'qcp-natural: 0.4.0.194112.1.0' o 'qcp-natural-qscd: 0.4.0.194112.1.2'
TV_LOG035=El estado del servicio es [{0}]
TV_LOG036=El estado es OK, como es una CA, se considera su estado de revocaci\u00F3n OK
TV_LOG037=El estado es OK, al ser tipo final, se establece el estado a detectado y desconocido. Hay que comprobar el estado de revocaci\u00F3n
TV_LOG038=El estado no es OK, segun el TSP Service,la cadena de certificaci\u00F3n no es v\u00E1lida. 
TV_LOG039=El estado no es OK, segun el TSP Service, est\u00E1 revocado.

#UtilsProviders
UP_LOG000 = No se ha encontrado ning\u00FAn proveedor criptogr\u00E1fico declarado en la JDK que disponga del algoritmo de generaci\u00F3n de n\u00FAmeros aleatorios [{0}].
UP_LOG001 = No se ha encontrado el algoritmo de generaci\u00F3n de n\u00FAmeros aleatorios [{0}] para el proveedor [{1}]. Se procede a intentar obtener este mismo algoritmo para cualquier otro proveedor declarado en la JDK.
UP_LOG002 = No se ha encontrado el proveedor criptogr\u00E1fico [{0}]. Se intentar\u00E1 obtener el algoritmo de generaci\u00F3n de numeros aleatorios [{1}] para cualquier otro proveedor declarado en la JDK.
UP_LOG003 = Se ha obtenido un generador de n\u00FAmeros aleatorios para el algoritmo [{0}] y proveedor [{1}].
UP_LOG004 = Se va a usar un generador de n\u00FAmeros aleatorios para el algoritmo [{0}] y proveedor [{1}].

#UtilsCertificateTsl
UC_LOG000 = Error durante la creaci\u00F3n del certificado.
UC_LOG001 = Error obteniendo la clave p\u00FAblica del certificado. La clave p\u00FAblica es inv\u00E1lida.
UC_LOG002 = Error durante la creaci\u00F3n del certificado.
UC_LOG003 = Error realizando el hash del certificado.
UC_LOG004 = Error obteniendo el proveedor para el certificado dado.
UC_LOG005 = Error al tratar de obtener los prop\u00F3sitos de clave del certificado.

#UtilsHTTP
UH_LOG_000 = La conexi\u00F3n se ha establecido.
UH_LOG_001 = Se ha excedido el tama\u00F1o m\u00E1ximo permitido de la longitud de los datos a descargar [{0} bytes].
UH_LOG_002 = La longitud de los datos [{0} bytes] excede del tama\u00F1o m\u00E1ximo permitido [{1} bytes].
UH_LOG_003 = La cantidad de bytes le\u00EDdos no coincide con la cantidad de bytes que ocupa el recurso al que se trata de acceder.
UH_LOG_004 = Informaci\u00F3n extraida correctamente de la respuesta http/s.
UH_LOG_005 = Se ha producido un error en la conexi\u00F3n HTTP/S. StatusCode: [{0}]; ReasonPhrase: [{1}];
UH_LOG_006 = Se ha producido un error en la conexi\u00F3n HTTP/S. Ni siquiera se ha obtenido respuesta.
UH_LOG_007 = No se ha conseguido obtener los datos de [{0}].
UH_LOG_008 = Los datos de entrada para la conexi\u00F3n HTTP/S mediante POST no pueden ser nulos.
UH_LOG_009 = Enviando petici\u00F3n HTTP/S a la ruta [{0}].
UH_LOG_010 = Recibida respuesta del servidor.
UH_LOG_011 = Leyendo informacion desde el origen...
UH_LOG_012 = El Content-Type de la respuesta no es [{0}], sino que se ha recibido Content-type: [{1}].
UH_LOG_013 = Se ha producido un error al cerrar los recursos usados para la conexi\u00F3n.
UH_LOG_014 = No se pudieron obtener los datos de respuesta de [{0}].

#UtilsProxy
UPR_LOG000 = Se ha producido un error al cargar el host y puerto a usar para el proxy (Host=[{0}], Port=[{1}]), por lo que no se usar\u00E1 proxy para las conexiones.
UPR_LOG001 = Se ha producido un error al cargar el host y puerto a usar para el proxy seguro (Host=[{0}], Port=[{1}]), por lo que no se usar\u00E1 proxy seguro para las conexiones.
UPR_LOG002 = Se ha producido un error al cargar el usuario y password para la autenticaci\u00F3n en el proxy (User=[{0}], Password=[{1}]), por lo que no se usar\u00E1 autenticaci\u00F3n para el proxy.
UPR_LOG003 = Se ha producido un error al cargar el usuario y password para la autenticaci\u00F3n en el proxy seguro (User=[{0}], Password=[{1}]), por lo que no se usar\u00E1 autenticaci\u00F3n para el proxy seguro.
UPR_LOG004 = Se ha producido un error al cargar el domain y workstation para la autenticaci\u00F3n NTLM en el proxy (Domain=[{0}], WorkStation=[{1}]), por lo que se usar\u00E1 autenticaci\u00F3n b\u00E1sica para el proxy (no NTLM).
UPR_LOG005 = Se ha producido un error al cargar el domain y workstation para la autenticaci\u00F3n NTLM en el proxy seguro (Domain=[{0}], WorkStation=[{1}]), por lo se usar\u00E1 autenticaci\u00F3n b\u00E1sica para el proxy seguro (no NTLM).
UPR_LOG006 = Se ha cargado correctamente la configuraci\u00F3n del proxy.
UPR_LOG007 = No se ha podido determinar si se trata de una ruta local por lo que se considera que no lo es. Se ha tratado de comprobar la ruta: [{0}].
UPR_LOG008 = No se pudo comprobar si la URL [{0}] es una de las asignadas para las que NO se usar\u00E1 el proxy, por lo que por defecto se permite el uso del proxy para dicha URL.


#IntegraSSLSocketFactory
UTILS_SSL_SOCKET_000 = No se han obtenido los algoritmos de cifrado que deben ser restringidos en la comunicaci\u00F3n SSL.
UTILS_SSL_SOCKET_001 = No se han obtenido los protocolos que deben ser restringidos en la comunicaci\u00F3n SSL.

#UtilsCRL
UTILS_CRL_000 = No fu\u00E9 posible instanciar la factor\u00EDa de X.509 para construir la CRL.
UTILS_CRL_001 = Se ha producido un error construyendo X.509 CRL a partir de los datos de entrada.
UTILS_CRL_002 = No se puede hacer uso de la CRL para comprobar el estado del certificado, ya que no es indirecta y su emisor [{0}] no coincide con el del certificado [{1}].
UTILS_CRL_003 = No se puede hacer uso de la CRL para comprobar el estado del certificado, ya que no es indirecta y su emisor [{0}] no coincide con el del certificado [{1}] ni con ninguno de los confiables (aportados para esta CRL).
UTILS_CRL_004 = Se produjo un error tratando de analizar el contenido de la CRL.

#UtilsLDAP
UTILS_LDAP_000 = Se produjo un error al tratar de realizar una conexi\u00F3n LDAP [{0}] (si el puerto no se especifica en la URL, se usa por defecto [{1}]).
UTILS_LDAP_001 = Se produjo un error al tratar de realizar una conexi\u00F3n LDAP [{0}] (si el puerto no se especifica en la URL, se usa por defecto [{1}]) haciendo uso del usuario [{2}] y password [XXXXXXX].
UTILS_LDAP_002 = Se ha encontrado la ruta dentro del LDAP, pero no contiene el atributo [certificateRevocationList], por lo que no se ha recuperado ninguna CRL.
UTILS_LDAP_003 = Se ha encontrado la ruta dentro del LDAP, y esta contiene el atributo [certificateRevocationList].
UTILS_LDAP_004 = No existe ninguna CRL en la ruta indicada dentro del LDAP.
UTILS_LDAP_005 = Se ha producido un error tratando de explorar la ruta dentro del LDAP.

#es.gob.afirma.tsl.certValidation.impl.common.TSLValidatorThroughCRL
TVTCRL_LOG000= No se tiene acceso o no es posible parsear la CRL.
TVTCRL_LOG001=El esquema de la URI [{0}] no es v\u00E1lido para la descarga de una CRL. Este deber\u00EDa ser de tipo HTTP, LDAP o FTP.
TVTCRL_LOG002=La CRL obtenida ya hab\u00EDa expirado para la fecha [{0}]. Su periodo de validez finalizaba el [{1}].
TVTCRL_LOG003=Hubo un error al tratar de consultar si el certificado a validar se encuentra revocado sobre la CRL.
TVTCRL_LOG004=No se han encontrado puntos de distribuci\u00F3n de tipo CRL en el certificado a validar.
TVTCRL_LOG005=No se conf\u00EDa en el emisor de CRL [{1}].
TVTCRL_LOG006=Se produjo un error al tratar de descargar una CRL mediante LDAP situada en la ruta [{0}], por lo que se tratar\u00E1 de buscar una alternativa si es posible.
TVTCRL_LOG007=Se produjo un error al tratar de descargar una CRL mediante FTP situada en la ruta [{0}], por lo que se tratar\u00E1 de buscar una alternativa si es posible.
TVTCRL_LOG008=Se produjo un error al tratar de descargar una CRL mediante HTTP situada en la ruta [{0}], por lo que se tratar\u00E1 de buscar una alternativa si es posible.

# Textos de AES Cipher.
AESCIPHER001 = Error inicializando el codificador AES.
AESCIPHER002 = Error decodificando el mensaje.
AESCIPHER003 = Error codificando el mensaje.

#UtilsConnection
UTILS_CONNECTION_000 = La propiedad [{0}] no contiene un valor adecuado. Se tomar\u00E1 su valor por defecto: [{1}].
UTILS_CONNECTION_001 = La propiedad [{0}] no tiene un valor asignado. Se tomar\u00E1 su valor por defecto: [{1}].


#es.gob.afirma.tsl.TslValidation
TSLVAL_LOG001 = Se ha solicitado la detecci\u00F3n del certificado mediante TSL, y opcionalmente obtener sus datos y comprobaci\u00F3n de estado de revocaci\u00F3n, con los siguientes par\u00E1metros: [Aplicaci\u00F3n -> {0}] | [Aplicaci\u00F3n delegada -> {1}] | [Localizaci\u00F3n TSL -> {2}] | [Certificado -> {3}] | [Fecha detecci\u00F3n -> {4}] | [Obtener informaci\u00F3n -> {5}] | [Comprobar estado revocaci\u00F3n -> {6}] | [Devolver evidencia de revocaci\u00F3n -> {7} | [CRLs -> {8}] | [OCSPs -> {9}].
TSLVAL_LOG002 = Se ha solicitado la informaci\u00F3n de la TSL con los siguientes par\u00E1metros: [Aplicaci\u00F3n -> {0}] | [Aplicaci\u00F3n delegada -> {1}] | [Pa\u00EDs/Regi\u00F3n -> {2}] | [Localizaci\u00F3n TSL -> {3}] | [Obtener XML de la TSL -> {4}].
TSLVAL_LOG003 = El m\u00E9todo no ha recibido los siguientes par\u00E1metros obligatorios para su ejecuci\u00F3n:
TSLVAL_LOG004 = No se puede devolver la informaci\u00F3n de revocaci\u00F3n si no se ha indicado que se debe comprobar el estado de revocaci\u00F3n del certificado o se han enviado evidencias de revocaci\u00F3n a analizar.
TSLVAL_LOG005 = S\u00F3lo se puede indicar el pa\u00EDs/regi\u00F3n de la TSL o su localizaci\u00F3n, pero no ambos simult\u00E1nemente.
TSLVAL_LOG006 = La fecha de validaci\u00F3n recibida [{0}] no es v\u00E1lida ya que es posterior a la actual [{1}] (se tiene en cuenta una ventana temporal de [{2}] milisegundos).
TSLVAL_LOG007 = No se ha encontrado informaci\u00F3n de la TSL solicitada.
TSLVAL_LOG008 = Se ha obtenido correctamente la informaci\u00F3n de la TSL solicitada.
TSLVAL_LOG009 = Se produjo un error controlado durante la ejecuci\u00F3n del servicio [{0}]. Debe consultarse el log del servidor para m\u00E1s informaci\u00F3n.
TSLVAL_LOG010 = Se produjo un error controlado durante la ejecuci\u00F3n del servicio [{0}] por lo que no se completa la ejecuci\u00F3n del servicio y se devuelve como respuesta que no ha sido posible su ejecuci\u00F3n.
TSLVAL_LOG011 = Se produjo un error NO controlado durante la ejecuci\u00F3n del servicio [{0}].
TSLVAL_LOG012 = Se produjo un error parseando el certificado de entrada. Este debe indicarse en Base64 (cadena).
TSLVAL_LOG013 = No se ha encontrado ninguna TSL para el pa\u00EDs/regi\u00F3n [{0}].
TSLVAL_LOG014 = No se ha encontrado ninguna TSL definida por la localizaci\u00F3n [{0}].
TSLVAL_LOG015 = Se ha completado el an\u00E1lisis del certificado sobre la TSL.
TSLVAL_LOG016 = Se ha encontrado una TSL para la localizaci\u00F3n [{0}] y fecha [{1}]. Se ha completado el an\u00E1lisis del certificado sobre la TSL.
TSLVAL_LOG017 = El certificado no ha sido detectado en la TSL.
TSLVAL_LOG018 = El certificado ha sido detectado en la TSL.
TSLVAL_LOG019 = El certificado ha sido detectado en la TSL. NO se ha obtenido la informaci\u00F3n de mapeos asociada a este.
TSLVAL_LOG020 = El certificado ha sido detectado en la TSL. Se ha obtenido la informaci\u00F3n de mapeos asociada a este.
TSLVAL_LOG021 = No fue posible determinar el estado de revocaci\u00F3n del certificado.
TSLVAL_LOG022 = Se ha comprobado el estado de revocaci\u00F3n del certificado: OK.
TSLVAL_LOG023 = Se ha comprobado el estado de revocaci\u00F3n del certificado: Revocado.
TSLVAL_LOG024 = Se ha comprobado el estado de revocaci\u00F3n del certificado: Caducado: Cadena de certificaci\u00F3n no v\u00E1lida (ha expirado su periodo de validez).
TSLVAL_LOG025 = Se ha comprobado el estado de revocaci\u00F3n del certificado: Revocado: El servicio que lo reconoce est\u00E1 revocado.
TSLVAL_LOG026 = Se ha comprobado el estado de revocaci\u00F3n del certificado: Unknown: El servicio que reconoce el certificado ha dejado de estar supervisado.
TSLVAL_LOG027 = El certificado ha sido detectado en la TSL. NO se ha obtenido la informaci\u00F3n de revocaci\u00F3n asociada a este.
TSLVAL_LOG028 = El certificado ha sido detectado en la TSL. Se ha obtenido la informaci\u00F3n de revocaci\u00F3n asociada a este.
TSLVAL_LOG029 = El certificado ha sido detectado en la TSL. NO se ha obtenido la informaci\u00F3n de mapeos asociada a este. NO se ha obtenido la informaci\u00F3n de revocaci\u00F3n asociada a este.
TSLVAL_LOG030 = El certificado ha sido detectado en la TSL. NO se ha obtenido la informaci\u00F3n de mapeos asociada a este. Se ha obtenido la informaci\u00F3n de revocaci\u00F3n asociada a este.
TSLVAL_LOG031 = El certificado ha sido detectado en la TSL. Se ha obtenido la informaci\u00F3n de mapeos asociada a este. NO se ha obtenido la informaci\u00F3n de revocaci\u00F3n asociada a este.
TSLVAL_LOG032 = El certificado ha sido detectado en la TSL. Se ha obtenido la informaci\u00F3n de mapeos asociada a este. Se ha obtenido la informaci\u00F3n de revocaci\u00F3n asociada a este.
TSLVAL_LOG033 = La fecha de validaci\u00F3n recibida [{0}] no es v\u00E1lida ya que no cumple el formato [{1}].
TSLVAL_LOG034 = Al menos una de las CRLs recibidas no es parseable.
TSLVAL_LOG035 = Al menos una de las respuestas OCSP b\u00E1sicas recibidas no es parseable.
TSLVAL_LOG036 = Se ha producido un error intentando recuperar la aplicaci\u00F3n [{0}] de la cach\u00E9 de configuraci\u00F3n.
TSLVAL_LOG037 = La aplicaci\u00F3n [{0}] no es reconocida y por tanto no est\u00E1 autorizada.
TSLVAL_LOG038 = Se ha producido un error calculando el array de bytes que representa la respuesta, por lo que no se incluir\u00E1 el mensaje de cierre de transacci\u00F3n en auditor\u00EDa.
TSLVAL_LOG039 = Se ha producido un error calculando el array de bytes que representa el conjunto de par\u00E1metros de entrada del servicio.
TSLVAL_LOG040 = No se ha obtenido resultado del proceso de detecci\u00F3n de certificado en la TSL indicada.
TSLVAL_LOG041 = Se ha obtenido la informaci\u00F3n de mapeos asociada al certificado.
TSLVAL_LOG042 = Inicio de obtenci\u00F3n de mapeos asociada al certificado.
TSLVAL_LOG043 = Fin de obtenci\u00F3n de mapeos asociada al certificado. Tiempo empleado: [{0} milisegundos].
TSLVAL_LOG044 = No se han obtenido los mapeos desde la TSL, al no detectarse el certificado.

#es.gob.afirma.tsl.parsing.impl.common.extensions
EXT_LOG001=Error: La extensi\u00F3n ExpiredCertsRevocationInfo solo puede encontrarse (ser del tipo) [{0}], y en este caso es [{1}].
EXT_LOG002=Error: La extensi\u00F3n [{0}] no puede ser cr\u00EDtica.
EXT_LOG003=Error: La extensi\u00F3n [{0}] no puede ser asociada a un servicio de tipo [{1}].
EXT_LOG004=Error: La extensi\u00F3n [{0}] no contiene un n\u00FAmero de elementos adecuados.
EXT_LOG005=Error: La extensi\u00F3n [{0}] no puede tener el valor [{1}].
EXT_LOG006=Error: La extensi\u00F3n [{0}] debe definir un valor adecuado para el elemento [{1}].
EXT_LOG007=Error: La URI definida en la extensi\u00F3n Qualification-Qualifier no tiene un valor v\u00E1lido: [{0}].
EXT_LOG008=Error: La extensi\u00F3n Qualifications solo puede encontrarse (ser del tipo) [{0}], y en este caso es [{1}].
EXT_LOG009=Error: La extensi\u00F3n [{0}] de tipo [{2}] es desconocida y cr\u00EDtica.
EXT_LOG010= Se produjo un error mientras se trataba de parsear el certificado a validar para obtener su extensi\u00F3n 'CertificatePolicies'. Se considera que el certificado no cumple el criterio.

#es.gob.afirma.tsl.parsing.impl.common.CertSubjectDNAttributeOtherCriteria
CSDAOC_LOG001=Error parseando el certificado a validar para obtener su Subject DN y analizarlo seg\u00FAn lo que indica la TSL.
CSDAOC_LOG002=El criterio alternativo CertSubjectDNAttribute debe definir al menos un OID.

#es.gob.afirma.tsl.parsing.impl.common.ExtendedKeyUsageOtherCriteria
EKVOC_LOG001=Error obteniendo la extensi\u00F3n de uso de clave del certificado a validar para comprobar que contiene aquellas indicadas por la TSL.
EKVOC_LOG002=El criterio alternativo ExtendedKeyUsage debe definir al menos un OID.

#es.gob.afirma.tsl.parsing.impl.tsl119612.v020101.AdditionalServiceInformation
ASI_LOG001=Error: La extensi\u00F3n AdditionalServiceInformation solo puede encontrarse (ser del tipo) [{0}], y en este caso es [{1}].
ASI_LOG002=Error: La extensi\u00F3n [{0}] debe definir un valor adecuado para el elemento [{1}].
ASI_LOG003=Error: La extensi\u00F3n AdditionalServiceInformation no tiene asignada una URI correcta: [{0}].
ASI_LOG004=Error: Para la extensi\u00F3n AdditionalServiceInformationExtension, si se asigna la URI [{0}], el tipo de servicio asociado debe ser forzosamente [{1}].
ASI_LOG005=Se ha detectado en el TSP Service [{0}] la extensi\u00F3n AdditionalServiceInformation con la URI [{1}], la cual no es conocida. Al no estar establecida como extensi\u00F3n cr\u00EDtica, se ignora y se contin\u00FAa con el proceso.
TSLP_LOG001=Error parseando la URI que representa una localizaci\u00F3n de una TSL [{0}].


#UtilsCrypto
UTILS_CRYPTO_000 = El algoritmo de hash [{0}] no est\u00E1 soportado.
UTILS_CRYPTO_001 = El algoritmo de hash no puede ser nulo, hay que especificarlo correctamente.
UTILS_CRYPTO_002 = Los datos sobre los que calcular el hash no pueden ser nulos o vac\u00EDos.

#es.gob.afirma.tsl.certValidation.impl.TSLValidatorMappingCalculator
TVMC_LOG001 = Se extrae la informaci\u00F3n de los mapeos del resultado obtenido.
TVMC_LOG002 = Primero se establece si el certificado es qualified o no...
TVMC_LOG003 = Si dispone de la extensi\u00F3n QcStatement y al menos uno es de los cualificados, o en su defecto hay una extensi\u00F3n Certificate Policies, Policy Information que determina que es cualificado...
TVMC_LOG004 = El certificado es qualified.
TVMC_LOG005 = El certificado no es qualified.
TVMC_LOG006 = Ha ocurrido un error al comprobar si el certificado es qualified o no.
TVMC_LOG007 = Como de la TSL se obtiene qscd UNKNOWN, se obtiene el valor qscd desde el certificado.
TVMC_LOG008 = Como la TSL se obtiene el valor MAPPING_QSCD_ASINCERT, el valor qscd se obtiene del certiticado.
TVMC_LOG009=  Como de la TSL se obtiene classification UNKNOWN, se obtiene dicho resultado desde el certificado.
TVMC_LOG010= Como de la TSL se obtiene tipo de maepo UNKNOWN, se obtiene si es qualified o no desde el certificado.
TVMC_LOG011= De la TSL se obtiene certificado es no cualificado.
TVMC_LOG012= De la TSL se obtiene certificado cualificado.
TVMC_LOG013= De la TSL se obtiene certClassification NATURAL PERSON
TVMC_LOG014= De la TSL se obtiene certClassification LEGAL PERSON
TVMC_LOG015= De la TSL se obtiene certClassification ESEAL
TVMC_LOG016= De la TSL se obtiene certClassification ESIG
TVMC_LOG017= De la TSL se obtiene certClassification WSA
TVMC_LOG018= De la TSL se obtiene certClassification TSA
TVMC_LOG019= De la TSL se obtiene qscd NO
TVMC_LOG020= De la TSL se obtiene qscd YES
TVMC_LOG021= Ha ocurrido un error al obtener el valor qscd desde el certificado, se establece el valor de qscd UNKNOWN.
TVMC_LOG022 = De la TSL se obtiene qscd YES_MANAGED_ON_BEHALF

#es.gob.afirma.tsl.parsing.impl.common.SecureXmlBuilder
SXB_LOG001=No se ha podido establecer el procesado seguro en la factoria XML
SXB_LOG002=No se ha podido establecer una propiedad de seguridad [{0}] en la factoria XML
